Revit 2027 API
DocumentPrintingEventArgs.GetViewElementIds Method
 Returns ElementIds of the views to be printed.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetViewElementIds()
Public Function GetViewElementIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetViewElementIds()
member GetViewElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 ElementIds of the views to be printed.
See Also
Reference
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace